Core/src/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>PLU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyСтрана</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодСтрана</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyЗарезервировано</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодЗарезервировано</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyМодель</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодМодель</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyКатегория</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyБренд</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодБренд</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПродукт</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодПродукт</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyКонтрольноеЧисло</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/АдресаВесов/АдресаВесов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресаВесов</name>
  <resources>
    <name>НаименованиеВесов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Месторасположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выгружать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IPAdress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1СРарусФискальныеРегистраторыМебиус</name>
      <description>1С-Рарус:Фискальные регистраторы Мебиус</description>
    </items>
    <items>
      <name>Драйвер1СРарусФискальныеРегистраторыФеликс</name>
      <description>1С-Рарус:Фискальные регистраторы Феликс</description>
    </items>
    <items>
      <name>Драйвер1СWebСервисОборудование</name>
      <description>1С:Web-сервис оборудование</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателя</name>
      <description>1С:Дисплей покупателя</description>
    </items>
    <items>
      <name>Драйвер1СККМOffline</name>
      <description>1С:ККМ Offline</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкода</name>
      <description>1С:Сканеры штрихкода (COM)</description>
    </items>
    <items>
      <name>Драйвер1ССканерыШтрихкодаNative</name>
      <description>1С:Сканеры штрихкода (NativeApi)</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКарт</name>
      <description>1С:Считыватели магнитных карт</description>
    </items>
    <items>
      <name>Драйвер1ССчитывателиМагнитныхКартNative</name>
      <description>1С:Считыватели магнитных карт (NativeApi)</description>
    </items>
    <items>
      <name>Драйвер1СФискальныйРегистраторЭмулятор</name>
      <description>1С:Фискальный регистратор (эмулятор)</description>
    </items>
    <items>
      <name>Драйвер1СЭквайринговыеТерминалыСбербанк</name>
      <description>1С:Эквайринговые терминалы Сбербанк</description>
    </items>
    <items>
      <name>ДрайверACOMВесыСПечатьюЭтикеток</name>
      <description>ACOM:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверARCUS2ЭквайринговыеТерминалыIngenico</name>
      <description>ARCUS2:Эквайринговые терминалы Ingenico</description>
    </items>
    <items>
      <name>ДрайверCASВесыСПечатьюЭтикеток</name>
      <description>CAS:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесы</name>
      <description>CAS:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверERFIDСчитывательRFID</name>
      <description>ERFID:Считыватель RFID</description>
    </items>
    <items>
      <name>ДрайверIboxProПоддержкаMPosЭквайринга</name>
      <description>iboxPro:Поддержка mPos эквайринга</description>
    </items>
    <items>
      <name>ДрайверIronLogicСчитывателиБесконтактныхКарт</name>
      <description>IronLogic:Считыватели бесконтактных карт Z-2</description>
    </items>
    <items>
      <name>ДрайверISBCСчитывательRFID</name>
      <description>ISBC:Считыватель RFID</description>
    </items>
    <items>
      <name>ДрайверTransLinkRESTAPIЭквайринговыеТерминалы</name>
      <description>TransLinkRESTAPI:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверTransLinkRESTAPIсинхЭквайринговыеТерминалы</name>
      <description>TransLinkRESTAPIсинх:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверTRPOSЭквайринговыеТерминалы</name>
      <description>TRPOS:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверUCSEFTPOSЭквайринговыеТерминалы</name>
      <description>UCS-EFTPOS:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверАТОЛВесыСПечатьюЭтикеток8X</name>
      <description>АТОЛ:Весы c печатью этикеток 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолДисплеиПокупателя</name>
      <description>АТОЛ:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверАтолДисплеиПокупателя8X</name>
      <description>АТОЛ:Дисплеи покупателя 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолККТ54ФЗ</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАтолККМOffline</name>
      <description>АТОЛ:Рабочее место кассира</description>
    </items>
    <items>
      <name>ДрайверАтолСканерыШтрихкода</name>
      <description>АТОЛ:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверАтолСканерыШтрихкода8X</name>
      <description>АТОЛ:Сканеры штрихкода 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолСчитывателиМагнитныхКарт</name>
      <description>АТОЛ:Считыватели магнитных карт</description>
    </items>
    <items>
      <name>ДрайверАтолСчитывателиМагнитныхКарт8X</name>
      <description>АТОЛ:Считыватели магнитных карт 8.X</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанных</name>
      <description>АТОЛ:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверАтолТерминалыСбораДанныхMobileLogistics</name>
      <description>АТОЛ:Терминалы сбора данных MobileLogistics 8.Х</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторыУниверсальный</name>
      <description>АТОЛ:Фискальные регистраторы (Универсальный)</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторы</name>
      <description>АТОЛ:Фискальные регистраторы 6.Х</description>
    </items>
    <items>
      <name>ДрайверАтолФискальныеРегистраторы8X</name>
      <description>АТОЛ:Фискальные регистраторы 8.Х</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы</name>
      <description>АТОЛ:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверАтолЭлектронныеВесы8X</name>
      <description>АТОЛ:Электронные весы 8.Х</description>
    </items>
    <items>
      <name>ДрайверВерсияТФискальныеРегистраторы</name>
      <description>Версия-Т:Фискальные регистратоы КАСБИ</description>
    </items>
    <items>
      <name>ДрайверГАЗПРОМБАНКЭквайринговыеТерминалы</name>
      <description>ГАЗПРОМБАНК:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверГексагонПринтераЭтикеток</name>
      <description>Гексагон:Принтера этикеток Zebra,Proton,Toshiba-TEC,Datamax-O neil</description>
    </items>
    <items>
      <name>ДрайверГексагонСканерыШтрихкода</name>
      <description>Гексагон:Сканеры штрихкода Proton</description>
    </items>
    <items>
      <name>ДрайверГексагонТерминалыСбораДанных</name>
      <description>Гексагон:Терминалы сбора данных Goods</description>
    </items>
    <items>
      <name>ДрайверИскраФискальныеРегистраторыПрим</name>
      <description>Драйвер &quot;Искра:Фискальные регистраторы Прим&quot;</description>
    </items>
    <items>
      <name>ДрайверBOG_AXConnect</name>
      <description>Драйвер BOG AXConnect</description>
    </items>
    <items>
      <name>ДрайверDATECSФискальныйРегистратор</name>
      <description>Драйвер DATECS Фискальный регистратор</description>
    </items>
    <items>
      <name>ДрайверОптимусФискальныйРегистратор</name>
      <description>Драйвер оптимус фискальный регистратор</description>
    </items>
    <items>
      <name>ДрайверДримкасФискальныеРегистраторыVikiPrint</name>
      <description>Дримкас:Фискальные регистраторы VikiPrint</description>
    </items>
    <items>
      <name>ДрайверИНПАСЭквайринговыеТерминалыSmart</name>
      <description>ИНПАС:Эквайринговые терминалы Smart</description>
    </items>
    <items>
      <name>ДрайверИНПАСЭквайринговыеТерминалыUNIPOS</name>
      <description>ИНПАС:Эквайринговые терминалы UNIPOS</description>
    </items>
    <items>
      <name>ДрайверККСДисплеиПокупателя</name>
      <description>ККС:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверККСФискальныеРегистраторы</name>
      <description>ККС:Фискальные регистраторы Спарк</description>
    </items>
    <items>
      <name>ДрайверКлеверенсСчитывателиRFID</name>
      <description>Клеверенс:Считыватели RFID</description>
    </items>
    <items>
      <name>ДрайверКлеверенсТерминалыСбораДанных</name>
      <description>Клеверенс:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверКристаллСервисДисплеиПокупателяVikiVision</name>
      <description>Кристалл Сервис:Дисплей покупателя VikiVision</description>
    </items>
    <items>
      <name>ДрайверКристаллСервисФискальныеРегистраторыPirit</name>
      <description>Кристалл Сервис:Фискальные регистраторы Pirit</description>
    </items>
    <items>
      <name>ДрайверМассаКВесыСПечатьюЭтикеток</name>
      <description>Масса-К:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверМассаКЭлектронныеВесы</name>
      <description>Масса-К:Электронные весы</description>
    </items>
    <items>
      <name>ДрайверОРИОНФискальныеРегистраторы</name>
      <description>ОРИОН:Фискальный регистратор ФР01К</description>
    </items>
    <items>
      <name>ДрайверСБРФЭквайринговыеТерминалы</name>
      <description>СБРФ:Эквайринговые терминалы</description>
    </items>
    <items>
      <name>ДрайверСканкодДисплеиПокупателя</name>
      <description>Сканкод:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверСканкодПринтераЭтикетокGodexEZPL8Native</name>
      <description>Сканкод:Принтера этикетокGodexEZPL8 (NativeAPI)</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерыШтрихкода</name>
      <description>Сканкод:Сканеры штрихкода</description>
    </items>
    <items>
      <name>ДрайверСканкодСчитывательRFIDCipherLab</name>
      <description>Сканкод:Считыватели RFID CipherLab</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанных</name>
      <description>Сканкод:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверСканкодТерминалыСбораДанныхNative</name>
      <description>Сканкод:Терминалы сбора данных CipherLAB 8x00 (NativeApi)</description>
    </items>
    <items>
      <name>ДрайверСканситиПринтераЭтикеток</name>
      <description>Скансити:Принтер печати этикеток TSC</description>
    </items>
    <items>
      <name>ДрайверСканситиТерминалыСбораДанных</name>
      <description>Скансити:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверШтрихМВесыСПечатьюЭтикеток</name>
      <description>Штрих-М:Весы с печатью этикеток</description>
    </items>
    <items>
      <name>ДрайверШтрихМДисплеиПокупателя</name>
      <description>Штрих-М:Дисплеи покупателя</description>
    </items>
    <items>
      <name>ДрайверШтрихМККМOffline</name>
      <description>Штрих-М:Кассир</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗ</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверШтрихМПлатежныйТерминалYarus</name>
      <description>Штрих-М:Платежный терминал Yarus</description>
    </items>
    <items>
      <name>ДрайверШтрихМТерминалыСбораДанных</name>
      <description>Штрих-М:Терминалы сбора данных</description>
    </items>
    <items>
      <name>ДрайверШтрихМФискальныеРегистраторы</name>
      <description>Штрих-М:Фискальные регистраторы</description>
    </items>
    <items>
      <name>ДрайверШтрихМФискальныеРегистраторыУниверсальный</name>
      <description>Штрих-М:Фискальные регистраторы (Универсальный)</description>
    </items>
    <items>
      <name>ДрайверШтрихМЭлектронныеВесы</name>
      <description>Штрих-М:Электронные весы</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяДистрибутивом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженныйДрайвер</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакетаДрайвера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СнятСПоддержки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/CommonModules/ОбменСВесамиСПечатьюЭтикетокСервер/Module.bsl
Функция СписокИспользуемыхВесов()
	
	ДрайверОборудования = Новый Массив;
	ДрайверОборудования.Добавить(Справочники.ДрайверыОборудования.ДрайверDigiВесыСПечатьюЭтикеток);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодключаемоеОборудование.Ссылка
	                      |ИЗ
	                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	                      |ГДЕ
	                      |	ПодключаемоеОборудование.УстройствоИспользуется
	                      |	И ПодключаемоеОборудование.ТипОборудования = &ТипОборудования
	                      |	И ПодключаемоеОборудование.ДрайверОборудования В(&ДрайверОборудования)
	                      |	И НЕ ПодключаемоеОборудование.ПометкаУдаления");
						  
	Запрос.УстановитьПараметр("ТипОборудования",	 Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	Запрос.УстановитьПараметр("ДрайверОборудования", ДрайверОборудования);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивВесов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		МассивВесов.Добавить(Выборка.Ссылка);		
	КонецЦикла;
	
	Возврат МассивВесов;
	
КонецФункции

Функция ТипОборудования(ПодключаемоеОборудование) Экспорт
	
	Возврат ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера;

КонецФункции

Функция ПараметрыОборудования(ПодключаемоеОборудование) Экспорт
	
	ПараметрыПодключения = Новый Массив;
	ПараметрыПодключения.Добавить(ПодключаемоеОборудование.Параметры.Получить());
	
	Возврат ПараметрыПодключения;
	  
КонецФункции

Функция ТаблицаВыгрузкиТоваров(ВидЦены, ОтборПоТоварам = Неопределено) Экспорт     	
	
	ТаблицаВыгрузкиТоваров = Новый Массив;                
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура,
		|	&ВидЦены КАК ВидЦены,
		|	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Номенклатура.НаименованиеПолное КАК СТРОКА(256)) КАК НаименованиеНоменклатуры,
		|	ШтрихкодыНоменклатуры.PLU КАК PLU,
		|	ШтрихкодыНоменклатуры.PLU КАК Код,
		|	ШтрихкодыНоменклатуры.Номенклатура.СрокГодности КАК СрокГодности,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 2, 1) = ""2""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Весовая,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.ЕдиницаИзмерения = NULL
		|				ИЛИ ШтрихкодыНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|				ИЛИ ШтрихкодыНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ШтрихкодыНоменклатуры.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения.Наименование КАК ПредставлениеВесовойЕдиницы,
		|	0 КАК Цена,
		|	ШтрихкодыНоменклатуры.Номенклатура.Родитель.Код КАК КодРодитель
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура.ВыгружатьВВесы = ИСТИНА
		|	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""2"""  + 
		
		?(ОтборПоТоварам = Неопределено,"","
		|И Номенклатура В (&ОтборПоТоварам)");
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	PLU";
	
	
	Запрос.УстановитьПараметр("ВидЦены",		ВидЦены);
	Запрос.УстановитьПараметр("ОтборПоТоварам",	ОтборПоТоварам);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл
		
		СтрокаТЧ.Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, ТекущаяДата(), ВидЦены, СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);
		
		Если СтрокаТЧ.PLU = 0 Тогда
			//сгенерируем новый PLU
			СтрокаТЧ.PLU = СгенерироватьНовыйPLU(СтрокаТЧ.Штрихкод);
			СтрокаТЧ.Код = СтрокаТЧ.PLU;			
		КонецЕсли;
	
		СтруктураСтроки = Новый Структура("Штрихкод,НаименованиеНоменклатуры,Весовая,ЕдиницаИзмерения,ПредставлениеВесовойЕдиницы,Номенклатура,PLU,Код,КодРодитель,Цена,СрокГодности");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,СтрокаТЧ);
		 
		ТаблицаВыгрузкиТоваров.Добавить(СтруктураСтроки);
		
	КонецЦикла;		
		
	Возврат ТаблицаВыгрузкиТоваров;
	
КонецФункции

Функция ДиапазоныВесовыхШтрихкодов() Экспорт
	
	Возврат ОбщегоНазначенияПовтИсп.ДиапазоныВесовыхШтрихкодов();
	
КонецФункции

Функция Ping(IPАдрес)
	
	objShell = Новый COMОбъект("WScript.Shell") ;
    objScriptExec = objShell.Exec("ping.exe -n 1 " + IPАдрес) ;
    strPingResults = НРег(objScriptExec.StdOut.ReadAll());
	
	Возврат   Найти(strPingResults, "ttl=");
	
КонецФункции

//გადატვირთვა
Функция Выгрузить(Подразделение = Неопределено, Весы = Неопределено) Экспорт
		
	Если Не ЗначениеЗаполнено(Весы) Тогда 
		МассивВесов = СписокИспользуемыхВесов();
		
		Для Каждого ТоргВесы Из МассивВесов Цикл
			ТипОборудования = ТипОборудования(ТоргВесы);
			ПараметрыПодключения = ПараметрыОборудования(ТоргВесы);
			
			Если ПараметрыПодключения.Количество() > 0 Тогда 
				
				Если ЗначениеЗаполнено(Подразделение) И Подразделение <> ПараметрыПодключения[0].Подразделение Тогда 
					Продолжить;	
				КонецЕсли;
				
			Иначе 
				Возврат Неопределено;
			КонецЕсли;			
			
			//УзелОбменаДляВесы = ПланыОбмена.ВыгрузкаВВесах.НайтиПоРеквизиту("Весы",ТоргВесы);			
			//Если Не ЗначениеЗаполнено(УзелОбменаДляВесы) Тогда 
			//	Продолжить;
			//КонецЕсли;
						
			ОтветPing = Ping(ПараметрыПодключения[0].IPАдрес);
			
			Если ОтветPing = 0 Тогда 
				
				//нзСтатусыВесов = РегистрыСведений.СтатусыВесов.СоздатьНаборЗаписей();
				//нзСтатусыВесов.Отбор.ПланОбменаВеса.Установить(УзелОбменаДляВесы);
				//сзСтатусыВесов = нзСтатусыВесов.Добавить();
				//сзСтатусыВесов.Период = ТекущаяДата();
				//сзСтатусыВесов.ПланОбменаВеса = УзелОбменаДляВесы;
				//сзСтатусыВесов.Включено = Ложь;
				//нзСтатусыВесов.Записать(Истина);
				Продолжить;	
				
			Иначе 
				//нзСтатусыВесов = РегистрыСведений.СтатусыВесов.СоздатьНаборЗаписей();
				//нзСтатусыВесов.Отбор.ПланОбменаВеса.Установить(УзелОбменаДляВесы);
				//сзИБР_СтатусыВесов = нзСтатусыВесов.Добавить();
				//сзИБР_СтатусыВесов.Период = ТекущаяДата();
				//сзИБР_СтатусыВесов.ПланОбменаВеса = УзелОбменаДляВесы;
				//сзИБР_СтатусыВесов.Включено = Истина;
				//нзСтатусыВесов.Записать(Истина);
		
			КонецЕсли;
									
			//Запрос = Новый Запрос("ВЫБРАТЬ
			//|	НоменклатураИзменения.Ссылка
			//|ИЗ
			//|	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
			//|ГДЕ
			//|	НоменклатураИзменения.Узел = &УзелОбменаДляВесы");
			//
			//Запрос.УстановитьПараметр("УзелОбменаДляВесы",  УзелОбменаДляВесы);					  
			//
			//ОтборПоТоварам = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			//                           
			
			ОтборПоТоварам = Неопределено;
			ТаблицаТоваров = ТаблицаВыгрузкиТоваров(ПараметрыПодключения[0].ВидЦен, ОтборПоТоварам);
			//			
			//ТаблицаТоваровЗнч = Новый ТаблицаЗначений;
			//ТаблицаТоваровЗнч.Колонки.Добавить("Номенклатура");
			//ТаблицаТоваровЗнч.Колонки.Добавить("Цена");
			//
			//Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл 
			//	СтрокаТоваровЗнч = ТаблицаТоваровЗнч.Добавить();	
			//	ЗаполнитьЗначенияСвойств(СтрокаТоваровЗнч,СтрокаТоваров);
			//КонецЦикла;
			//			
			//Для Каждого Номенклатура Из ОтборПоТоварам Цикл 
			//	
			//	СтрокаТоваров =  ТаблицаТоваровЗнч.Найти(Номенклатура);
			//	
			//	Если СтрокаТоваров = Неопределено ИЛИ СтрокаТоваров.Цена = 0 Тогда 
			//		
			//		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаДляВесы,Номенклатура);
			//		
			//	КонецЕсли;						
			//									
			//КонецЦикла;
			
			Если ТоргВесы.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверDigiВесыСПечатьюЭтикеток Тогда 
				ВыгрузитьТоварыDIGI(ПараметрыПодключения[0], ТаблицаТоваров);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ТаблицаТоваров;		
		
	Иначе
		ТипОборудования = ТипОборудования(Весы);
		ПараметрыПодключения = ПараметрыОборудования(Весы);
		ТаблицаТоваров = ТаблицаВыгрузкиТоваров(ПараметрыПодключения[0].Подразделение, ОтборПоТоварам);
		
		Если Весы.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверDigiВесыСПечатьюЭтикеток Тогда 
			ВыгрузитьТоварыDIGI(ПараметрыПодключения[0], ТаблицаТоваров);
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТаблицаТоваров;	
	
КонецФункции

//digi
Функция ВыгрузитьТоварыDIGI(ПараметрыПодключения, Товары, УзелОбменаДляВесы = Неопределено) Экспорт
	
	АдресПрограмы = ПараметрыПодключения.АдресПрограмы;
	IPАдрес = ПараметрыПодключения.IPАдрес;
	
	Текст = Новый ТекстовыйДокумент;                                            
	Текст.УстановитьТипФайла(КодировкаТекста.ANSI); 
	
	ВременнаяСтрокаЗаписи = "";
	СтрокаГорячихКнопок = "";
		
	//МенеджерЗаписи = РегистрыСведений.ВыгрузкаВВесах.СоздатьНаборЗаписей();
	//МенеджерЗаписи.Отбор.Весы.Установить(УзелОбменаДляВесы);
	
	Для Каждого ТекСтр Из Товары Цикл	
		
		НаименованиеНоменклатуры = ТекСтр.НаименованиеНоменклатуры;
		
		HEXДлинаНаим =  DecToHex(СтрДлина(НаименованиеНоменклатуры));     				
		Шрифт = ПолучитьРазмерДляШрифта(СтрДлина(НаименованиеНоменклатуры));   				
		НеХватаетРазмера = 2 - СтрДлина(HEXДлинаНаим);   
		
		НехватающаяЧасть = "";
		
		Пока   НеХватаетРазмера<> 0 Цикл    				  
			НехватающаяЧасть = НехватающаяЧасть + "0"; 
			НеХватаетРазмера = НеХватаетРазмера - 1; 					
		КонецЦикла;	
		
		HEXДлинаНаим = НехватающаяЧасть + HEXДлинаНаим;       			
		
		НаимНомен = ?(СтрДлина(НаименованиеНоменклатуры)>52,Сред(НаименованиеНоменклатуры,1,52),НаименованиеНоменклатуры);
		НаименованиеТовараКод =   ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(НаимНомен);
		
		ItemPLU = Формат(Число(ТекСтр.PLU),"ЧЦ=8; ЧВН=; ЧГ=0");  			  
		
		Если ТекСтр.Весовая Тогда
			PLUSTATUS = "7C00";
		Иначе
			PLUSTATUS = "7D00";                                                                                                                                                             
		КонецЕсли;    			  
		
		ЦенаКопеек   = Формат(Цел(Текстр.Цена*100) ,  "ЧЦ=8; ЧДЦ=0; ЧН=; ЧВН=; ЧГ=0" );   					  
		ЦенаКонечная = Строка(ЦенаКопеек);//8   
		
		ПолеШтрихКод = Сред(Текстр.Штрихкод,1,12);   				
		Срок = "0000";
		
		Срок = ТекСтр.СрокГодности; 
		Срок = Строка(Срок);
		Срок = СокрЛП(Срок);
		Срок = СтрЗаменить(Срок, Символ(160), "");
		Срок = Лев("0000", 4-СтрДлина(Срок)) + Срок;  				
		
		СтрокаПередРазмером = PLUSTATUS + "DD215F" + ЦенаКонечная + "1105" + ПолеШтрихКод + "00" + Срок + "00000000000000000000000000010000000000000000000000" + Шрифт + HEXДлинаНаим + НаименованиеТовараКод ; 
		
		//Формат არ იმუშავებს, რადგან ასოებიც შედის !!! ფორმატი თექვსმეტობით რიცხვებს ვერ აღიქვამს,  PluRecordSize სტრიქონია !!!!
		PluRecordSize =  DecToHex( (СтрДлина(СтрокаПередРазмером) + 16) /2 )  ; 
		
		НеХватаетРазмера = 4 - СтрДлина(PluRecordSize);    			  
		НехватающаяЧасть = "";    
		
		Пока   НеХватаетРазмера <> 0 Цикл  				  
			НехватающаяЧасть = НехватающаяЧасть + "0"; 
			НеХватаетРазмера = НеХватаетРазмера - 1; 				  
		КонецЦикла;		
		
		PluRecordSize = НехватающаяЧасть + PluRecordSize;   			  
		
		//წონითი FE01, არაწონითი FF01 , ცალ-ცალკე სტრიქონებად არ ვწერთ !!!! 
		ВременнаяСтрокаЗаписи = ВременнаяСтрокаЗаписи + ItemPLU + PluRecordSize + PLUSTATUS + "DD211F" + ЦенаКонечная + "1105" + ПолеШтрихКод +
		"00000000000000" + Срок + "000000000000000100"+Шрифт +HEXДлинаНаим+НаименованиеТовараКод+"0C00"+"DA000000000000000000"; 
			
		//"ცხელი ღილაკები"   - HOTKEYS
		ВыгрузитьКнопки = Ложь;
		
		//СтрТаблица = МенеджерЗаписи.Добавить();
		//СтрТаблица.Весы 		= УзелОбменаДляВесы;	
		//СтрТаблица.Номенклатура = ТекСтр.Номенклатура;
		//СтрТаблица.PLU 			= ТекСтр.PLU;
		//СтрТаблица.Цена 		= ТекСтр.Цена;
		//СтрТаблица.Период 		= ТекущаяДата();
		
	КонецЦикла;	  
	
	СтрокаДляЗадачи = "";
	СтрокаДляЗадачиКнопок = "";
	
	Если Не ВременнаяСтрокаЗаписи = "" Тогда
		
		Текст.ДобавитьСтроку(ВременнаяСтрокаЗаписи);				
				
		Если Не Найти ( IPАдрес,"." ) = 0 Тогда	
			
			ФорматIP   =  СтрЗаменить(СтрЗаменить(IPАдрес," ",""),Символы.Таб,""); 							
			ПослБайтIP =  Домейн(ФорматIP,Истина);		
			
			Если  ПослБайтIP = -1 Тогда	
				Сообщить("სასწორის მისამართი"+ IPАдрес + "არასწორია !");
				Возврат Ложь;
			КонецЕсли;
			
			ИмяФайлаВыгрузки = АдресПрограмы + "\SM" + ПослБайтIP + "F25.DAT";  					
			СтрокаДляЗадачи = СтрокаДляЗадачи + Домейн(ФорматIP,Истина)+" ";     				
			
			Попытка
				Текст.Записать(ИмяФайлаВыгрузки, КодировкаТекста.ANSI);       					
			Исключение
				Сообщить("ვერ მოხერხდა მონაცემების გადატვირთვა. გადაამოწმეთ სასწორის მისამართი");
				Возврат Ложь;
			КонецПопытки;   
		Иначе
			Сообщить("სასწორის მისამართი" + IPАдрес + "არასწორია !");					
		КонецЕсли;	
					  				
		
		АдресДрайвера = АдресПрограмы+"\twswtcp.exe";
		Драйвер = Новый Файл(АдресДрайвера);
		
		Если НЕ СтрокаДляЗадачи = "" Тогда
			
			ТекстЗадачи = Новый ТекстовыйДокумент;   					
			ТекстЗадачи.ДобавитьСтроку("TWSWTCP F25 "+СтрокаДляЗадачи);
			ТекстЗадачи.Записать(АдресПрограмы+"\ExportDataIntoScales.bat",КодировкаТекста.ANSI);					
			ЗапуститьПриложение("ExportDataIntoScales.bat",АдресПрограмы,Истина); 
			
			ERROR = Новый ТекстовыйДокумент;
			
			ERROR.Прочитать(АдресПрограмы +"\error");
			
			ТекстОшиб = ERROR.ПолучитьТекст();//+";";
			
			Пока ТекстОшиб <> "0" Цикл
				
				АдресНеудачногоВеса = Сред( ТекстОшиб,1,Найти(ТекстОшиб,";")-1);
				Сообщить("სასწორთან მისამართით " + АдресНеудачногоВеса +  " დაკავშირებისას მოხდა შეცდომა, PLU გადატვირთვა წარუმატებელია! გადაამოწმეთ სასწორის აწყობები");
				ТекстОшиб = Сред (ТекстОшиб, Найти(ТекстОшиб,";")+1, СтрДлина(ТекстОшиб));
				
				//Для Каждого ЭлементЗаписи Из МенеджерЗаписи Цикл 
				//	ЭлементЗаписи.Выгрузка = Ложь;	
				//КонецЦикла;
				//Попытка
				//	МенеджерЗаписи.Записать(Ложь);
				//Исключение
				//КонецПопытки;
								
				Возврат Ложь;
			КонецЦикла;	
			
		КонецЕсли;	
			
		//Для Каждого ЭлементЗаписи Из МенеджерЗаписи Цикл 
		//	ЭлементЗаписи.Выгрузка = Истина;	
		//	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбменаДляВесы,ЭлементЗаписи.Номенклатура);
		//КонецЦикла;
		//
		//Попытка
		//	МенеджерЗаписи.Записать(Ложь);
		//Исключение
		//КонецПопытки;
						
	КонецЕсли;	
	
КонецФункции

Функция DecToHex(_Число)
	
                База = 16;
                Результат = "";
                Пока _Число <> 0 Цикл
                               Поз =_Число % База;
                               Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
                               _Число = Цел(_Число / База);
                КонецЦикла;
                Возврат Результат;
				
КонецФункции // DecToHex() 

Функция ПолучитьРазмерДляШрифта(Длина)
	
	Если Длина < 15 Тогда 		
		Возврат "08";     		
	ИначеЕсли Длина < 20 Тогда
		Возврат "08";
	ИначеЕсли Длина < 25 Тогда
		Возврат "07";	
	ИначеЕсли Длина < 28 Тогда	
		Возврат "06";
	ИначеЕсли Длина < 33 Тогда	
		Возврат "05";
	ИначеЕсли Длина < 35 Тогда	
		Возврат "03";
	ИначеЕсли Длина < 43 Тогда	
		Возврат "02";
	Иначе
		Возврат "01";
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьНаименование_GE_RU_DIGI_ДляПрямогоЭкспорта(Наименование) Экспорт
	
	//გასაღებებად გვინდოდა სიმბოლოებიც, რაც სტრუქტურას არ შეუძლია
	СоответствиеКодировки = Новый Соответствие;
	
	СоответствиеКодировки.Вставить("0", "30");
	СоответствиеКодировки.Вставить("1", "31");
	СоответствиеКодировки.Вставить("2", "32");
	СоответствиеКодировки.Вставить("3", "33");
	СоответствиеКодировки.Вставить("4", "34");
	СоответствиеКодировки.Вставить("5", "35");
	СоответствиеКодировки.Вставить("6", "36");
	СоответствиеКодировки.Вставить("7", "37");
	СоответствиеКодировки.Вставить("8", "38");
	СоответствиеКодировки.Вставить("9", "39");	  	
	
	СоответствиеКодировки.Вставить("a", "61");
	СоответствиеКодировки.Вставить("b", "62");
	СоответствиеКодировки.Вставить("c", "63");
	СоответствиеКодировки.Вставить("d", "64");
	СоответствиеКодировки.Вставить("e", "65");
	СоответствиеКодировки.Вставить("f", "66");
	СоответствиеКодировки.Вставить("g", "67");
	СоответствиеКодировки.Вставить("h", "68");
	СоответствиеКодировки.Вставить("i", "69");
	СоответствиеКодировки.Вставить("j", "6A");
	СоответствиеКодировки.Вставить("k", "6B");
	СоответствиеКодировки.Вставить("l", "6C");
	СоответствиеКодировки.Вставить("m", "6D");
	СоответствиеКодировки.Вставить("n", "6E");
	СоответствиеКодировки.Вставить("o", "6F");
	СоответствиеКодировки.Вставить("p", "70");
	СоответствиеКодировки.Вставить("q", "71");
	СоответствиеКодировки.Вставить("r", "72");
	СоответствиеКодировки.Вставить("s", "73");
	СоответствиеКодировки.Вставить("t", "74");
	СоответствиеКодировки.Вставить("u", "75");
	СоответствиеКодировки.Вставить("v", "76");
	СоответствиеКодировки.Вставить("w", "77");
	СоответствиеКодировки.Вставить("x", "78");
	СоответствиеКодировки.Вставить("y", "79");
	СоответствиеКодировки.Вставить("z", "7A");
	
	СоответствиеКодировки.Вставить("A", "41");
	СоответствиеКодировки.Вставить("B", "42");
	СоответствиеКодировки.Вставить("C", "43");
	СоответствиеКодировки.Вставить("D", "44");
	СоответствиеКодировки.Вставить("E", "45");
	СоответствиеКодировки.Вставить("F", "46");
	СоответствиеКодировки.Вставить("G", "47");
	СоответствиеКодировки.Вставить("H", "48");
	СоответствиеКодировки.Вставить("I", "49");
	СоответствиеКодировки.Вставить("J", "4A");
	СоответствиеКодировки.Вставить("K", "4B");
	СоответствиеКодировки.Вставить("L", "4C");
	СоответствиеКодировки.Вставить("M", "4D");
	СоответствиеКодировки.Вставить("N", "4E");
	СоответствиеКодировки.Вставить("O", "4F");
	СоответствиеКодировки.Вставить("P", "50");
	СоответствиеКодировки.Вставить("Q", "51");
	СоответствиеКодировки.Вставить("R", "52");
	СоответствиеКодировки.Вставить("S", "53");
	СоответствиеКодировки.Вставить("T", "54");
	СоответствиеКодировки.Вставить("U", "55");
	СоответствиеКодировки.Вставить("V", "56");
	СоответствиеКодировки.Вставить("W", "57");
	СоответствиеКодировки.Вставить("X", "58");
	СоответствиеКодировки.Вставить("Y", "59");
	СоответствиеКодировки.Вставить("Z", "5A"); 
	
	СоответствиеКодировки.Вставить("ა", "C0");
	СоответствиеКодировки.Вставить("ბ", "C1");
	СоответствиеКодировки.Вставить("გ", "C2");
	СоответствиеКодировки.Вставить("დ","C3");
	СоответствиеКодировки.Вставить("ე","C4");
	СоответствиеКодировки.Вставить("ვ","C5");
	СоответствиеКодировки.Вставить("ზ","C6");
	СоответствиеКодировки.Вставить("თ","C8");
	СоответствиеКодировки.Вставить("ი","C9");
	СоответствиеКодировки.Вставить("კ","CA");
	СоответствиеКодировки.Вставить("ლ","CB");
	СоответствиеКодировки.Вставить("მ","CC");
	СоответствиеКодировки.Вставить("ნ","CD");
	СоответствиеКодировки.Вставить("ო","CF");
	СоответствиеКодировки.Вставить("პ","D0");
	СоответствиеКодировки.Вставить("ჟ","D1");
	СоответствиеКодировки.Вставить("რ","D2");
	СоответствиеКодировки.Вставить("ს","D3");
	СоответствиеКодировки.Вставить("ტ","D4");
	СоответствиеКодировки.Вставить("უ","D6");
	СоответствиеКодировки.Вставить("ფ","D7");
	СоответствиеКодировки.Вставить("ქ","D8");
	СоответствиеКодировки.Вставить("ღ","D9");
	СоответствиеКодировки.Вставить("ყ","DA");
	СоответствиеКодировки.Вставить("შ","DB");
	СоответствиеКодировки.Вставить("ჩ","DC");
	СоответствиеКодировки.Вставить("ც","DD");
	СоответствиеКодировки.Вставить("ძ","DE");
	СоответствиеКодировки.Вставить("წ","DF");
	СоответствиеКодировки.Вставить("ჭ","E0");
	СоответствиеКодировки.Вставить("ხ","E1");
	СоответствиеКодировки.Вставить("ჯ","E3");
	СоответствиеКодировки.Вставить("ჰ","E4"); 	
	
	СоответствиеКодировки.Вставить(",",  "2C"); 
	СоответствиеКодировки.Вставить(" ",  "20");
	СоответствиеКодировки.Вставить("""", "22");
	СоответствиеКодировки.Вставить("(",  "7B");
	СоответствиеКодировки.Вставить(")",  "7D");
	СоответствиеКодировки.Вставить("%",  "25");
	СоответствиеКодировки.Вставить("”",  "22");

	НаименованиеДляВесевогоТовара = "";
	Символ = "";
	
	Для Счт = 1 По СтрДлина(Наименование) Цикл
		
		ГрузинскийСимвол = Сред(Наименование, Счт, 1);    		
		
		Если СтрЧислоВхождений("0123456789აბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰABCDEFGHIJKLMNJPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz,()%-”""",ГрузинскийСимвол) > 0 Тогда 
			Символ = СоответствиеКодировки.Получить(ГрузинскийСимвол);  			
		Иначе   			
			Символ = "20"; 			
		КонецЕсли;     
		
		НаименованиеДляВесевогоТовара = НаименованиеДляВесевогоТовара + Символ; 
		
	КонецЦикла;
	
	Возврат НаименованиеДляВесевогоТовара;   	
	
КонецФункции

Функция  Домейн(IP,ДляЗадачи = Ложь)  Экспорт	
	
	   ScaleIP =  IP;    
	   
	   IPLastByte ="";
	   ИндексПоследнейТочки = СтрДлина(ScaleIP);
	   
	   НетТочки = Истина;
	   Счет = 0;
	   
	   Пока НетТочки Цикл  
		   
		   ВремСтрок = Сред (ScaleIP,ИндексПоследнейТочки,СтрДлина(ScaleIP));     		   
		   Если   Не Найти(ВремСтрок,".") = 0 Тогда   
			   НетТочки = Ложь;
			   Прервать;
		   КонецЕсли;
		   ИндексПоследнейТочки =  ИндексПоследнейТочки - 1;
		   IPLastByte =  ВремСтрок; 
		   Счет = Счет+1; 
		   
		   Если Счет >4 Тогда
			   Возврат -1;
		   КонецЕсли;	   
		 		   
	   КонецЦикла;	 
	   
	   Если ДляЗадачи Тогда   
		   Возврат  "" + Лев("000",3-СтрДлина(IPLastByte)) + IPLastByte;
	   Иначе   
		   Возврат  "S0"+Формат(IPLastByte,"ЧЦ=3; ЧВН=; ЧГ=0");
	   КонецЕсли;
	   
КонецФункции	

Функция ПолучитьРеквизитыОбъекта(ОбъектДанных) Экспорт
		
	впСтруктураВозврата = Новый Структура;
	Для Каждого впРеквизит Из ОбъектДанных.Метаданные().Реквизиты Цикл  
		
		впСтруктураВозврата.Вставить(впРеквизит.Имя, ОбъектДанных[впРеквизит.Имя]);
		
	КонецЦикла;
	
	Возврат впСтруктураВозврата;

КонецФункции 

Функция ПолучитьТаблицуНоменклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Номенклатура.НаименованиеПолное КАК СТРОКА(256)) КАК Наименование,
	               |	ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 7) КАК ШтрихКод,
	               |	ШтрихкодыНоменклатуры.PLU КАК PLU,
	               |	ШтрихкодыНоменклатуры.Номенклатура.СрокГодности КАК СрокГодности,
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодПолный,
	               |	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 2, 1) = ""2""
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Весовой
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО (ЦеныНоменклатурыСрезПоследних.ВидЦен В (&СпВидЦен))
	               |			И ШтрихкодыНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура.ВыгружатьВВесы = ИСТИНА
	               |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 1) = ""2""
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Номенклатура.НаименованиеПолное КАК СТРОКА(256)),
	               |	ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 7),
	               |	ШтрихкодыНоменклатуры.PLU,
	               |	ШтрихкодыНоменклатуры.Номенклатура.СрокГодности,
	               |	ШтрихкодыНоменклатуры.Штрихкод,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 2, 1) = ""2""
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ
	               |
	               |ИМЕЮЩИЕ
	               |	НЕ МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) = 0";
	МасВидовЦен = Новый Массив;
	МасВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("საცალო ფასი",	Истина));
	МасВидовЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("ფასი - საცალო",	Истина));
	Запрос.УстановитьПараметр("СпВидЦен",МасВидовЦен);
	Запрос.УстановитьПараметр("НаДату",	 ТекущаяДата());
	
	ТабНоменклатуры = Запрос.Выполнить().Выгрузить();
		
	Для каждого СтрНом Из ТабНоменклатуры Цикл
		Если СтрНом.PLU = 0 Тогда
			//сгенерируем новый PLU
			СтрНом.PLU = СгенерироватьНовыйPLU(СтрНом.ШтрихкодПолный);					
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТабНоменклатуры;
		
КонецФункции

Функция СгенерироватьНовыйPLU(ТекШК)
	
	ЗапросМаксПЛУ = Новый Запрос;
	ЗапросМаксПЛУ.Текст = "ВЫБРАТЬ
	                      |	МАКСИМУМ(ШтрихкодыНоменклатуры.PLU) КАК PLU
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры";
	РезЗапроса = ЗапросМаксПЛУ.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		ТекPLU = 1;
	Иначе
		ВыборкаЗап = РезЗапроса.Выбрать();
		ВыборкаЗап.Следующий();
		ТекPLU = ВыборкаЗап.PLU + 1;
	КонецЕсли;
		
	НЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	НЗ.Отбор.Штрихкод.Установить(ТекШК);
	НЗ.Прочитать();
	Для Каждого Зап Из НЗ Цикл
		Зап.PLU = ТекPLU;	
	КонецЦикла;
	НЗ.Записать();
	
	Возврат ТекPLU;
КонецФункции	

Функция ПолучитьНаименование_GE_RU(Наименование) Экспорт
	
	СоответствиеКодировки = Новый Структура;
	
	СоответствиеКодировки.Вставить("ა","А");
	СоответствиеКодировки.Вставить("ბ","Б");
	СоответствиеКодировки.Вставить("გ","В");
	СоответствиеКодировки.Вставить("დ","Г");	
	СоответствиеКодировки.Вставить("ე","Д");
	СоответствиеКодировки.Вставить("ვ","Е");
	СоответствиеКодировки.Вставить("ზ","Ж");
	СоответствиеКодировки.Вставить("თ","И");	
	СоответствиеКодировки.Вставить("ი","Й");
	СоответствиеКодировки.Вставить("კ","К");
	СоответствиеКодировки.Вставить("ლ","Л");
	СоответствиеКодировки.Вставить("მ","М");
	СоответствиеКодировки.Вставить("ნ","Н");
	СоответствиеКодировки.Вставить("ო","П");
	СоответствиеКодировки.Вставить("პ","Р");
	СоответствиеКодировки.Вставить("ჟ","С");
	СоответствиеКодировки.Вставить("რ","Т");
	СоответствиеКодировки.Вставить("ს","У");
	СоответствиеКодировки.Вставить("ტ","Ф");	
	СоответствиеКодировки.Вставить("უ","Ц");
	СоответствиеКодировки.Вставить("ფ","Ч");
	СоответствиеКодировки.Вставить("ქ","Ш");
	СоответствиеКодировки.Вставить("ღ","Щ");
	СоответствиеКодировки.Вставить("ყ","Ъ");
	СоответствиеКодировки.Вставить("შ","Ы");
	СоответствиеКодировки.Вставить("ჩ","Ь");
	СоответствиеКодировки.Вставить("ც","Э");
	СоответствиеКодировки.Вставить("ძ","Ю");
	СоответствиеКодировки.Вставить("წ","Я");
	СоответствиеКодировки.Вставить("ჭ","а");
	СоответствиеКодировки.Вставить("ხ","б");
	СоответствиеКодировки.Вставить("ჯ","г");
	СоответствиеКодировки.Вставить("ჰ","д");
	
	НаименованиеДляВесевогоТовара = "";
	Символ = "";
	
	Для Счт = 1 По СтрДлина(Наименование) Цикл
		
		ГрузинскийСимвол = Сред(Наименование, Счт, 1);
		
		Если СтрЧислоВхождений("აბგდევზთიკლმნოპჟრსტუფქღყშჩცძწჭხჯჰ",ГрузинскийСимвол) > 0 Тогда 
			
			СоответствиеКодировки.Свойство(ГрузинскийСимвол, Символ);
			
		Иначе 
			
			Символ = ГрузинскийСимвол;
			
		КонецЕсли;
		
		НаименованиеДляВесевогоТовара = НаименованиеДляВесевогоТовара + Символ; 
		
	КонецЦикла;
	
	Возврат НаименованиеДляВесевогоТовара;
	
	
КонецФункции

Процедура ВыгрузитьТоварыВВесы() Экспорт
	
	МассивIP = Новый Массив;
	ЗапросАдресов = Новый Запрос;
	ЗапросАдресов.Текст = "ВЫБРАТЬ
	                      |	АдресаВесов.IPAdress
	                      |ИЗ
	                      |	РегистрСведений.АдресаВесов КАК АдресаВесов
	                      |ГДЕ
	                      |	АдресаВесов.Выгружать = ИСТИНА
	                      |	И НЕ АдресаВесов.IPAdress = """"";
	РезЗапросаАдресов = ЗапросАдресов.Выполнить();
	Если НЕ РезЗапросаАдресов.Пустой() Тогда
		ВыборкаАдресов = РезЗапросаАдресов.Выбрать();
		Пока ВыборкаАдресов.Следующий() Цикл
			МассивIP.Добавить(СокрЛП(ВыборкаАдресов.IPAdress));	
		КонецЦикла; 	
	КонецЕсли;
		
	ТабНоменклатуры = ПолучитьТаблицуНоменклатуры();
	
	Для Каждого ЭлВесов Из МассивIP Цикл
		Попытка
			ПрогИД = "DigiSM.Scale";
			Драйвер = Новый COMОбъект(ПрогИД);
			Драйвер.Registered = "Developer License, RS Line LLC, ID 404395463";
			Драйвер.Copyright  = "Scale-Soft Site: http://scale-soft.com Email: support@scale-soft.com";
			Драйвер.ScaleIP = ЭлВесов; //автоматически задается значение ScalePort
			Драйвер.ScaleTimeOut = 1000;
			Ошиб = Драйвер.OpenConnect();
			Если Не Ошиб = 0 Тогда
				Если Ошиб = -1 Тогда
					Ошиб = Драйвер.CloseConnect();
					Драйвер = "";
					Продолжить;
				КонецЕсли;	
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = Ошиб;
				Сообщение.Сообщить();
			КонецЕсли;
                                         
			Для Каждого СтрТов Из ТабНоменклатуры Цикл
								
				//Задаем параметры товара
				Драйвер.ScaleTimeOut  = 1000;
				Драйвер.PLUType	  	  = СтрТов.Весовой; //0,1(весовой, штучный)
				Драйвер.PLUNo	  	  = СтрТов.PLU; //от 0 до 7500
				Драйвер.PLUName   	  = ПолучитьНаименование_GE_RU(СтрТов.Наименование); //макс. 412 символов
				Драйвер.GroupCode 	  = 0; //код основной группы
				Драйвер.ItemCode   	  = СтрТов.ШтрихКод; //префикс штрихкода + код товара макс. 12 цифр
				Драйвер.BarCodeFormat = 5; //Формат штрихкода - F1F2 CCCCC XXXXX CD (23 04567 вес CD)
				Драйвер.LabelFormat	  = "F1"; //1 свободный формат этикетки  (две строчки - 30 символов)
				Драйвер.LabelFont	  = "S5"; //Шрифт этикетки по умолчанию 5 × 7 (IngredientName)
				Драйвер.UnitPrice 	  = СтрТов.Цена*100;//цена товара (коп) от 0 до 999999 
				Драйвер.ShelfLife	  = СтрТов.СрокГодности;//срок годности (сут) от 0 до 999
				
				//Загружаем в весы параметры товара
				Ошиб = Драйвер.SendPLU();
				Если Не Ошиб = 0 Тогда
					Драйвер.CloseConnect();
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = Ошиб;
					Сообщение.Сообщить();
				КонецЕсли;	
					
			КонецЦикла;	
			
			Драйвер.CloseConnect();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = ЭлВесов;
			Сообщение.Сообщить();
			Драйвер = "";
			 
		Исключение
			Сообщить(ОписаниеОшибки());		
			тОписаниеОшибки = "Невозможно подключить OLE драйвер.
			| Проверьте, что OLE драйвер корректно установлен.";
			Сообщить(тОписаниеОшибки);
			пОшибка = Истина;
			
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьIPАдресВесов() Экспорт

	ЗапросАдресов = Новый Запрос;
	ЗапросАдресов.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	АдресаВесов.IPAdress
	                      |ИЗ
	                      |	РегистрСведений.АдресаВесов КАК АдресаВесов
	                      |ГДЕ
	                      |	АдресаВесов.Выгружать = ИСТИНА";
	РезЗапросаАдресов = ЗапросАдресов.Выполнить();
	Если РезЗапросаАдресов.Пустой() Тогда
		ТекущийIP = "";
	Иначе	
		ВыборкаАдресов = РезЗапросаАдресов.Выбрать();
		ВыборкаАдресов.Следующий();
		ТекущийIP = СокрЛП(ВыборкаАдресов.IPAdress);	
	КонецЕсли;
	
КонецФункции
